Revit 2027 API
ParameterTypeId.FamilyContentPartType Property
 "Part Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FamilyContentPartType { get; }
Public Shared ReadOnly Property FamilyContentPartType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FamilyContentPartType {
	ForgeTypeId^ get ();
}
static member FamilyContentPartType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace